Revit 2027 API
CurveElement.CreateAreaBasedLoadBoundaryLines Method
 Creates area based load boundary lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<CurveElement> CreateAreaBasedLoadBoundaryLines(
	Document document,
	IList<Curve> curves,
	ElementId levelId
)
Public Shared Function CreateAreaBasedLoadBoundaryLines (
	document As Document,
	curves As IList(Of Curve),
	levelId As ElementId
) As IList(Of CurveElement)
public:
static IList<CurveElement^>^ CreateAreaBasedLoadBoundaryLines(
	Document^ document,
	IList<Curve^>^ curves,
	ElementId^ levelId
)
static member CreateAreaBasedLoadBoundaryLines :
        document : Document *
        curves : IList<Curve> *
        levelId : ElementId -> IList<CurveElement>
Parameters
document Document
 The document in which to create the area based load boundary lines.
curves IList<Curve>
 The curves.
levelId ElementId
 The id of level.
Return Value
IList<CurveElement>
 The newly created area based load boundary lines.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- The input curves contains a null pointer or a curve that is not bounded. -or- The input curves contains at least one curve which is degenerate (its length is too close to zero). -or- The ElementId levelId is not a Level. -or- The input curves contains a curve doesn't lie in the plane of the level.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
See Also
Reference
CurveElement Class
Autodesk.Revit.DB Namespace